configuration/config/iplm/testresources/claimretrieve/RetrieveClaimRq-UUIDValidationSample.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" SOAP-ENV:mustUnderstand="1" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
      <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-812f0270-6f3a-4368-afae-eae2b02a6b81">
        <ds:SignedInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
          <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" />
          <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" />
          <ds:Reference URI="#id-aab82ea4-e369-4ffd-8084-0924f61e9e72" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
            <ds:Transforms xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" /></ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" />
            <ds:DigestValue xmlns:ds="http://www.w3.org/2000/09/xmldsig#">eopuVfZiy+ckTPS0QvMX6IZi1yg=</ds:DigestValue>
          </ds:Reference>
        </ds:SignedInfo>
        <ds:SignatureValue xmlns:ds="http://www.w3.org/2000/09/xmldsig#">QyfPkkwG0VVIi6FNmNpTSLXxzoQC2segy+/OgVnYFge0RcbwZl67ykwjdZdNybec/jdrHLRCVj/oHgij0eIvLyYFyGfqNXRusw/GdcvG75dpQMbQ2NGT15USY51XTUyGnU5/725MhdA4NoYbCJGeZgKNvJqRLL2ppEgdbi2Wn87qeHucC/Gkro91kkmcC1aFrexPulghhqJYD+cCCJVnn1uWdF+H80tP3KXFHrN0nA5sfi7EvSAe2/P3kIhY6bL4S82+wztc+Zop9SwoYea7YwVd3A3zQ99F8Dhlq92RYOxbQXe6hrEtniuGQBYSdgZeDVSuIrWODxhWzXbeJ1VEyg==</ds:SignatureValue>
        <ds:KeyInfo Id="KI-98eb47d3-62ca-42a8-a8c6-feec0fccf1fd" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
          <wsse:SecurityTokenReference wsu:Id="STR-06cc002b-2e74-4cb5-aaac-b77278452e46" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <ds:X509Data xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
              <ds:X509IssuerSerial xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                <ds:X509IssuerName xmlns:ds="http://www.w3.org/2000/09/xmldsig#">CN=Claim Center,OU=Development,O=Guidewire,L=Blanchardstown,ST=Dublin,C=IE</ds:X509IssuerName>
                <ds:X509SerialNumber xmlns:ds="http://www.w3.org/2000/09/xmldsig#">1304245758</ds:X509SerialNumber>
              </ds:X509IssuerSerial>
            </ds:X509Data>
          </wsse:SecurityTokenReference>
        </ds:KeyInfo>
      </ds:Signature>
    </wsse:Security>
    <xchangingheader xmlns="http://www.xchanging.com/wsdl/ClaimService/">
      <Sender xmlns="http://www.xchanging.com/wsdl/ClaimService/">
        <Party xmlns="http://www.xchanging.com/wsdl/ClaimService/">
          <Id xmlns="http://www.xchanging.com/wsdl/ClaimService/">urn:lloyds:0623</Id>
        </Party>
      </Sender>
      <Receiver xmlns="http://www.xchanging.com/wsdl/ClaimService/">
        <Party xmlns="http://www.xchanging.com/wsdl/ClaimService/">
          <Id xmlns="http://www.xchanging.com/wsdl/ClaimService/">236196817</Id>
        </Party>
      </Receiver>
      <MsgTypeCd xmlns="http://www.xchanging.com/wsdl/ClaimService/">RetrieveClaim</MsgTypeCd>
      <Timestamp xmlns="http://www.xchanging.com/wsdl/ClaimService/">2016-11-10T09:34:26Z</Timestamp>
      <RequestUUId xmlns="http://www.xchanging.com/wsdl/ClaimService/">e35d5a51-c536-431d-988b-0b80fa5d697e</RequestUUId>
    </xchangingheader>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-aab82ea4-e369-4ffd-8084-0924f61e9e72" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <RetrieveClaimRq xmlns="http://www.xchanging.com/retrieveClaim/rq/1" Receiver="serviceprovider" Sender="insurer">
      <UUId xmlns="http://www.ACORD.org/standards/Jv-Ins-Reinsurance/1">e35d5a51-c536-431d-988b-0b80fa5d697e</UUId>
      <CreationDate xmlns="http://www.ACORD.org/standards/Jv-Ins-Reinsurance/1">2016-11-10T09:34:26Z</CreationDate>
      <Insurer xmlns="http://www.ACORD.org/standards/Jv-Ins-Reinsurance/1">
        <Party xmlns="http://www.ACORD.org/standards/Jv-Ins-Reinsurance/1">
          <Id Agency="lloyds" xmlns="http://www.ACORD.org/standards/Jv-Ins-Reinsurance/1">urn:lloyds:0623</Id>
          <Name xmlns="http://www.ACORD.org/standards/Jv-Ins-Reinsurance/1">Beazley 0623</Name>
        </Party>
      </Insurer>
      <ServiceProvider xmlns="http://www.ACORD.org/standards/Jv-Ins-Reinsurance/1">
        <Party xmlns="http://www.ACORD.org/standards/Jv-Ins-Reinsurance/1">
          <Id Agency="Xchanging" xmlns="http://www.ACORD.org/standards/Jv-Ins-Reinsurance/1">236196817</Id>
          <Name xmlns="http://www.ACORD.org/standards/Jv-Ins-Reinsurance/1">Xchanging</Name>
        </Party>
      </ServiceProvider>
      <ReferredObjects xmlns="http://www.xchanging.com/retrieveClaim/rq/1">
        <Contract xmlns="http://www.xchanging.com/retrieveClaim/rq/1">
          <BrokerReference xmlns="http://www.ACORD.org/standards/Jv-Ins-Reinsurance/1">B9979ECF2WB5006</BrokerReference>
        </Contract>
        <Claim xmlns="http://www.xchanging.com/retrieveClaim/rq/1">
          <BrokerReference xmlns="http://www.ACORD.org/standards/Jv-Ins-Reinsurance/1">B9979ECF2WBSC7CN</BrokerReference>
          <ClaimLineNumber xmlns="http://www.xchanging.com/retrieveClaim/rq/1">1</ClaimLineNumber>
          <ClaimType xmlns="http://www.xchanging.com/retrieveClaim/rq/1">000</ClaimType>
        </Claim>
        <ClaimEntry xmlns="http://www.xchanging.com/retrieveClaim/rq/1">
          <BrokerReference xmlns="http://www.ACORD.org/standards/Jv-Ins-Reinsurance/1">B9979002</BrokerReference>
        </ClaimEntry>
      </ReferredObjects>
    </RetrieveClaimRq>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>